### Pandas Series

In [104]:
import pandas as pd
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [105]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [107]:
import pandas as pd
import numpy as np
animals = ['Tiger', 'Bear', None]
pd.Series(animals)
print(np.NaN == None) #false returned
print(np.isnan(np.nan)) #returns TRUE
print(animals)
print(pd.Series(animals))

False
True
['Tiger', 'Bear', None]
0    Tiger
1     Bear
2     None
dtype: object

In [109]:
#creating a series from a dictionary: 
sports = {'Archery': 'Bhutan', 'Golf': 'Scotland', 'Sumo': 'Japan', 
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
print(s)
print(" ")
print(s.index)
print(" ")
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
print(s)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [110]:
#querying a series: 
sports = {'Archery': 'Bhutan', 'Golf': 'Scotland', 'Sumo': 'Japan', 
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [111]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [112]:
#use iloc for positional indexing: 
s.iloc[0]
#returns the value corresponding to the index at position 0

'Bhutan'

In [113]:
#use loc for explicit indexing based on the actual index name: 
s.loc['Archery']

'Bhutan'

In [115]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [114]:
s.iloc[1:3]
#this returns a slice of our Series including the index - same as for lists and arrays

Golf    Scotland
Sumo       Japan
dtype: object

In [116]:
s[1:3]
#returns the same as above

Golf    Scotland
Sumo       Japan
dtype: object

In [117]:
#how do we get the index corresponding to the first element in our Series?
s.index[0]

'Archery'

In [118]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [119]:
#how do we subset our Series based on condition?
#Select all rows such that country is either Bhutan or Japan: 
s[(s=='Bhutan')|(s=='Japan')]

Archery    Bhutan
Sumo        Japan
dtype: object

In [120]:
#now, get corresponding indices based on the above: 
list(s[(s=='Bhutan')|(s=='Japan')].index)

['Archery', 'Sumo']

In [121]:
for label, value in s.iteritems():
        print((label,value))
#here, we can access both the index and the value of the Series

('Archery', 'Bhutan')
('Golf', 'Scotland')
('Sumo', 'Japan')
('Taekwondo', 'South Korea')

In [122]:
#note: Series is an object whose values can be changed!  So, here is how we can change a value in
#our series corresponding to the country 'Bhutan' to 'China': 
for label, value in s.iteritems():
        if value=='Bhutan':
            s.set_value(label, 'China')
s

Archery            China
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [123]:
#another way to achieve the above: let us change 'China' to 'Israel':
s.loc[s[s=='China'].index]='Israel'
s

Archery           Israel
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [124]:
#we can also add a row to a series: 
s.loc['Soccer']='France'
s

Archery           Israel
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Soccer            France
dtype: object

In [32]:
#Exercise: 
#create a new Series object called 's_new', which is created from s above as follows: if
#the country contains the word 'land' in it, then keep as is; otherwise, append the word "land" to 
#the name of the country.  For example, 'Scotland' stays as is.  Japan is changed to 'Japanland'. Hint:
#remember to use copy() method just like before to create a new object in memory

In [125]:
#your solution goes here
s_new=s.copy()
for label, value in s.iteritems():
        if value.find("land")!=-1:
            s_new.loc[label]=value
        else:
            s_new.loc[label]=value+"land"
s_new

Archery           Israelland
Golf                Scotland
Sumo               Japanland
Taekwondo    South Korealand
Soccer            Franceland
dtype: object

In [126]:
type(s.iloc[0])

str

### Pandas Data Frames

In [127]:
#a data frame is an object that consists of an index and multiple series objects.  It can also be 
#thought of as having rows and columns where each column is a list of data
dict1={'student':np.arange(1,11),
      'fruit':['banana','banana','apple','apple','apple',
               'orange','kiwi','kiwi','kiwi','kiwi'],
      'height':[6.1,6.0,5.3,5.8,7.2,4.9,5.4,np.nan,5.4,5.10]}
print('dict1: ',dict1)

dict1:  {'student': array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10]), 'fruit': ['banana', 'banana', 'apple', 'apple', 'apple', 'orange', 'kiwi', 'kiwi', 'kiwi', 'kiwi'], 'height': [6.1, 6.0, 5.3, 5.8, 7.2, 4.9, 5.4, nan, 5.4, 5.1]}

In [128]:
df1=pd.DataFrame(dict1,columns=['student','fruit','height'],
                index=np.arange(0,len(dict1['fruit'])))
df1
#remember: len function when applied to a dictionary object lists the number of key-value pairs in 
#that dictionary

   student   fruit  height
0        1  banana     6.1
1        2  banana     6.0
2        3   apple     5.3
3        4   apple     5.8
4        5   apple     7.2
5        6  orange     4.9
6        7    kiwi     5.4
7        8    kiwi     NaN
8        9    kiwi     5.4
9       10    kiwi     5.1

In [129]:
df1.info()
#note, there are both numerical and categorical columns in our data frame

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 3 columns):
student    10 non-null int32
fruit      10 non-null object
height     9 non-null float64
dtypes: float64(1), int32(1), object(1)
memory usage: 280.0+ bytes

In [130]:
df1.describe()
#student and height are numeric columns, and we can see their distribution as follows:

        student    height
count  10.00000  9.000000
mean    5.50000  5.688889
std     3.02765  0.693622
min     1.00000  4.900000
25%     3.25000  5.300000
50%     5.50000  5.400000
75%     7.75000  6.000000
max    10.00000  7.200000

In [131]:
df1['fruit'].value_counts()
#fruit is a categorical column, and this shows us the frequency of each value..

kiwi      4
apple     3
banana    2
orange    1
Name: fruit, dtype: int64

In [ ]:
#there are also ordinal columns..

In [132]:
dict2={'fruit':['banana','orange',
               'apple','kiwi'],
       'price':[3.1,4.2,3.5,5.3]}
df2=pd.DataFrame(dict2,columns=['fruit','price'])
df2

    fruit  price
0  banana    3.1
1  orange    4.2
2   apple    3.5
3    kiwi    5.3

In [133]:
#same rules as for Series apply, except with iloc and loc can now also be used to find values 
#at intersection of rows and columns: 
df2.iloc[1:3]
#this lists full rows

    fruit  price
1  orange    4.2
2   apple    3.5

In [134]:
df2.iloc[1:3,0]

1    orange
2     apple
Name: fruit, dtype: object

In [135]:
df2.loc[1:3,'fruit']
#note below that this includes the '3' index, since .loc reads explicit index names, not positional

1    orange
2     apple
3      kiwi
Name: fruit, dtype: object

In [136]:
#how do we add a row to our Data Frame: 
df1

   student   fruit  height
0        1  banana     6.1
1        2  banana     6.0
2        3   apple     5.3
3        4   apple     5.8
4        5   apple     7.2
5        6  orange     4.9
6        7    kiwi     5.4
7        8    kiwi     NaN
8        9    kiwi     5.4
9       10    kiwi     5.1

In [137]:
df1.loc[10]=[11,'orange',7.8]       
df1

    student   fruit  height
0         1  banana     6.1
1         2  banana     6.0
2         3   apple     5.3
3         4   apple     5.8
4         5   apple     7.2
5         6  orange     4.9
6         7    kiwi     5.4
7         8    kiwi     NaN
8         9    kiwi     5.4
9        10    kiwi     5.1
10       11  orange     7.8

In [138]:
#sorting our data frame by price from highest to lowest
print(df2)
print(" ")
df2.sort_values(by='price',inplace=True,ascending=False)
print(df2)

    fruit  price
0  banana    3.1
1  orange    4.2
2   apple    3.5
3    kiwi    5.3

    fruit  price
3    kiwi    5.3
1  orange    4.2
2   apple    3.5
0  banana    3.1

In [139]:
#note above that with sort_values, the index is also sorted. We can reset the index to be the same 
#as before: 
df2.reset_index(inplace=True)

In [140]:
df2

   index   fruit  price
0      3    kiwi    5.3
1      1  orange    4.2
2      2   apple    3.5
3      0  banana    3.1

In [141]:
#now, we see that the original index now became a column.  Let us drop it using the axis argument: 
df2.drop("index",axis=1,inplace=True)

In [61]:
df2

    fruit  price
0    kiwi    5.3
1  orange    4.2
2   apple    3.5
3  banana    3.1

In [142]:
#adding a column to a data frame
#let us add a column called 'size' to the above data frame and set it equal to price if it is more than
#5, otherwise set it to 0:
df2.loc[:,'size']=df2['price'].map(lambda x: x if x>5 else 0)
df2
#note: map function is a Series method which takes in a function and applies it to every element
#of the Series column

    fruit  price  size
0    kiwi    5.3   5.3
1  orange    4.2   0.0
2   apple    3.5   0.0
3  banana    3.1   0.0

In [143]:
#Basic data frame slicing: 
#select only fruit and size columns for which price is less than 4: 
df2[['fruit','size']][df2['price']<4]

    fruit  size
2   apple   0.0
3  banana   0.0

In [145]:
#.loc attribute can also be used to achieve the same result above:
df2.loc[df2['price']<4,['fruit','size']]

    fruit  size
2   apple   0.0
3  banana   0.0

In [146]:
df2

    fruit  price  size
0    kiwi    5.3   5.3
1  orange    4.2   0.0
2   apple    3.5   0.0
3  banana    3.1   0.0

In [147]:
print(type(df2['fruit']))
print(type(df2[['fruit']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [148]:
df1

    student   fruit  height
0         1  banana     6.1
1         2  banana     6.0
2         3   apple     5.3
3         4   apple     5.8
4         5   apple     7.2
5         6  orange     4.9
6         7    kiwi     5.4
7         8    kiwi     NaN
8         9    kiwi     5.4
9        10    kiwi     5.1
10       11  orange     7.8

### Vectorized String Method in Python

In [149]:
#let us recall some basic string methods we learned before: 
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [150]:
'peter'.count('e')
#count the number of times a substring occurs in a string

2

In [151]:
#concatenate strings: 
new_string="Peter"+" is"+" cool"
new_string

'Peter is cool'

In [153]:
#can also use the join method to achieve the above: 
new_string=" ".join(["Peter","is","cool"])
new_string
#above, join method takes a list of strings, and another string calls its join method 
#to concatenate the strings with itself

'Peter is cool'

In [154]:
"Peter".index("e")
#index returns first occurrence of an instance and error if not find

1

In [155]:
"Peter".index("a")

ValueError: substring not found

In [156]:
"Peter".find("a")

-1

In [157]:
"Peter".find("e")

1

In [158]:
a="Max is male"
a

'Max is male'

In [159]:
b=a.replace("male","definitely a male")
b

'Max is definitely a male'

In [80]:
a

'Max is male'

In [160]:
#now, let us come back to our data frame: 
df1

    student   fruit  height
0         1  banana     6.1
1         2  banana     6.0
2         3   apple     5.3
3         4   apple     5.8
4         5   apple     7.2
5         6  orange     4.9
6         7    kiwi     5.4
7         8    kiwi     NaN
8         9    kiwi     5.4
9        10    kiwi     5.1
10       11  orange     7.8

In [161]:
#recall how we can check for a particular integer to see whether it is missing or not: 
a=np.NaN
np.isnan(a)

True

In [ ]:
#Exercise: write one line of code to see whether the particular missing value of height in the 
#specified row and column is actually missing - use .iloc or .loc attributes..

In [163]:
#your code goes here..
np.isnan(df1.iloc[7,2])

True

In [164]:
df1

    student   fruit  height
0         1  banana     6.1
1         2  banana     6.0
2         3   apple     5.3
3         4   apple     5.8
4         5   apple     7.2
5         6  orange     4.9
6         7    kiwi     5.4
7         8    kiwi     NaN
8         9    kiwi     5.4
9        10    kiwi     5.1
10       11  orange     7.8

In [166]:
#now, let us try to add a column called 'fruit_first', which consists of just the first 3 letters of 
#the fruit value: 
df1['fruit_first']=df1['fruit'].map(lambda x: x[0:3])
df1

    student   fruit  height fruit_first
0         1  banana     6.1         ban
1         2  banana     6.0         ban
2         3   apple     5.3         app
3         4   apple     5.8         app
4         5   apple     7.2         app
5         6  orange     4.9         ora
6         7    kiwi     5.4         kiw
7         8    kiwi     NaN         kiw
8         9    kiwi     5.4         kiw
9        10    kiwi     5.1         kiw
10       11  orange     7.8         ora

In [167]:
#now, let us add a student and assign a missing fruit: 
df1.loc[11]=[12,np.nan,8.0,'ora']
df1

    student   fruit  height fruit_first
0         1  banana     6.1         ban
1         2  banana     6.0         ban
2         3   apple     5.3         app
3         4   apple     5.8         app
4         5   apple     7.2         app
5         6  orange     4.9         ora
6         7    kiwi     5.4         kiw
7         8    kiwi     NaN         kiw
8         9    kiwi     5.4         kiw
9        10    kiwi     5.1         kiw
10       11  orange     7.8         ora
11       12     NaN     8.0         ora

In [168]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 4 columns):
student        12 non-null int64
fruit          11 non-null object
height         11 non-null float64
fruit_first    12 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 480.0+ bytes

In [169]:
df1['fruit_first']=df1['fruit'].map(lambda x: x[0:3])
df1

TypeError: 'float' object is not subscriptable

In [170]:
#note above that we get an error, since we have a missing value: 
#for this, we can use the vectorized string attribute, called 'str': 
df1

    student   fruit  height fruit_first
0         1  banana     6.1         ban
1         2  banana     6.0         ban
2         3   apple     5.3         app
3         4   apple     5.8         app
4         5   apple     7.2         app
5         6  orange     4.9         ora
6         7    kiwi     5.4         kiw
7         8    kiwi     NaN         kiw
8         9    kiwi     5.4         kiw
9        10    kiwi     5.1         kiw
10       11  orange     7.8         ora
11       12     NaN     8.0         ora

In [171]:
#for example: 
df1['fruit_last']=df1.fruit.str[-3:]
df1

    student   fruit  height fruit_first fruit_last
0         1  banana     6.1         ban        ana
1         2  banana     6.0         ban        ana
2         3   apple     5.3         app        ple
3         4   apple     5.8         app        ple
4         5   apple     7.2         app        ple
5         6  orange     4.9         ora        nge
6         7    kiwi     5.4         kiw        iwi
7         8    kiwi     NaN         kiw        iwi
8         9    kiwi     5.4         kiw        iwi
9        10    kiwi     5.1         kiw        iwi
10       11  orange     7.8         ora        nge
11       12     NaN     8.0         ora        NaN

In [172]:
#we can get the number of characters in each value
df1['fruit_last']=df1.fruit.str.len()
df1

    student   fruit  height fruit_first  fruit_last
0         1  banana     6.1         ban         6.0
1         2  banana     6.0         ban         6.0
2         3   apple     5.3         app         5.0
3         4   apple     5.8         app         5.0
4         5   apple     7.2         app         5.0
5         6  orange     4.9         ora         6.0
6         7    kiwi     5.4         kiw         4.0
7         8    kiwi     NaN         kiw         4.0
8         9    kiwi     5.4         kiw         4.0
9        10    kiwi     5.1         kiw         4.0
10       11  orange     7.8         ora         6.0
11       12     NaN     8.0         ora         NaN

In [173]:
df1['fruit_last']=df1.fruit.str.contains("wi")
df1
#returns true if containst this substring, false otherwise..

    student   fruit  height fruit_first fruit_last
0         1  banana     6.1         ban      False
1         2  banana     6.0         ban      False
2         3   apple     5.3         app      False
3         4   apple     5.8         app      False
4         5   apple     7.2         app      False
5         6  orange     4.9         ora      False
6         7    kiwi     5.4         kiw       True
7         8    kiwi     NaN         kiw       True
8         9    kiwi     5.4         kiw       True
9        10    kiwi     5.1         kiw       True
10       11  orange     7.8         ora      False
11       12     NaN     8.0         ora        NaN

In [174]:
#another way to check for null values for any column..
len(df1[df1['fruit'].isnull()==True])

1

In [ ]:
#Exercise: create a new data frame, called df1_new, which only contains non missing values of fruit
#from df1. Then, add a column called 'fruit_subset', which is True if the fruit column value contains
#"ng" substring and False otherwise. Use map and lambda functions.

In [179]:
#your code goes here..
df1_new=df1.loc[df1['fruit'].isnull()==False,:].copy()
df1_new.loc[:,'fruit_subset']=df1_new['fruit'].map(lambda x: True if x.find("ng")!=-1 else False)
df1_new

    student   fruit  height fruit_first fruit_last  fruit_subset
0         1  banana     6.1         ban      False         False
1         2  banana     6.0         ban      False         False
2         3   apple     5.3         app      False         False
3         4   apple     5.8         app      False         False
4         5   apple     7.2         app      False         False
5         6  orange     4.9         ora      False          True
6         7    kiwi     5.4         kiw       True         False
7         8    kiwi     NaN         kiw       True         False
8         9    kiwi     5.4         kiw       True         False
9        10    kiwi     5.1         kiw       True         False
10       11  orange     7.8         ora      False          True